#### Terraform Plan Status: success

<details><summary>Show Plan</summary>

```
aws_api_gateway_rest_api.predictions_api: Refreshing state... [id=i08r86q01i]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/nba-cap-development-predictions-api]
aws_secretsmanager_secret.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1]
aws_cloudwatch_event_rule.monthly_etl: Refreshing state... [id=nba-cap-development-monthly-etl]
aws_iam_role.bastion: Refreshing state... [id=nba-cap-development-bastion-role]
aws_vpc.main: Refreshing state... [id=vpc-0b6c5f3947a364991]
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Reading...
aws_s3_bucket.data: Refreshing state... [id=nba-cap-development-data]
aws_cloudwatch_event_rule.weekly_ml_predictions: Refreshing state... [id=nba-cap-development-weekly-ml-predictions]
aws_iam_role.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn]
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Read complete after 0s [id=683313688378]
aws_cloudwatch_event_rule.monthly_ml_training: Refreshing state... [id=nba-cap-development-monthly-ml-training]
aws_s3_bucket.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_cloudwatch_event_rule.weekly_etl: Refreshing state... [id=nba-cap-development-weekly-etl]
aws_iam_role.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn]
aws_cloudfront_origin_access_identity.frontend: Refreshing state... [id=E2QKUUQXGKQ2NW]
aws_iam_role.step_functions: Refreshing state... [id=nba-cap-development-step-functions]
aws_iam_role.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml]
aws_iam_role.sagemaker_execution: Refreshing state... [id=nba-cap-development-sagemaker-execution]
aws_iam_role.lambda_execution: Refreshing state... [id=nba-cap-development-lambda-execution]
data.aws_ami.amazon_linux_2023: Reading...
aws_api_gateway_resource.teams: Refreshing state... [id=yl2ys4]
aws_api_gateway_resource.predictions: Refreshing state... [id=pf6a9y]
aws_api_gateway_resource.metadata: Refreshing state... [id=8fosh2]
aws_iam_instance_profile.bastion: Refreshing state... [id=nba-cap-development-bastion-profile]
aws_iam_role_policy_attachment.bastion_ssm: Refreshing state... [id=nba-cap-development-bastion-role-20260223231501912800000001]
aws_iam_role_policy.step_functions_lambda: Refreshing state... [id=nba-cap-development-step-functions:nba-cap-development-step-functions-lambda]
aws_api_gateway_method.teams_get: Refreshing state... [id=agm-i08r86q01i-yl2ys4-GET]
aws_api_gateway_resource.teams_detail: Refreshing state... [id=e38ice]
aws_api_gateway_resource.predictions_player: Refreshing state... [id=udgxfw]
aws_api_gateway_resource.predictions_overvalued: Refreshing state... [id=8djqun]
aws_api_gateway_resource.predictions_undervalued: Refreshing state... [id=kdbtn7]
aws_api_gateway_method.predictions_get: Refreshing state... [id=agm-i08r86q01i-pf6a9y-GET]
aws_iam_role_policy_attachment.sagemaker_full_access: Refreshing state... [id=nba-cap-development-sagemaker-execution-20260226055128501200000001]
module.cors_teams.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-yl2ys4-OPTIONS]
aws_api_gateway_method.metadata_get: Refreshing state... [id=agm-i08r86q01i-8fosh2-GET]
module.cors_predictions.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-pf6a9y-OPTIONS]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549032400000003]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549022400000002]
aws_api_gateway_method.teams_detail_get: Refreshing state... [id=agm-i08r86q01i-e38ice-GET]
module.cors_metadata.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-8fosh2-OPTIONS]
aws_api_gateway_method.predictions_player_get: Refreshing state... [id=agm-i08r86q01i-udgxfw-GET]
aws_api_gateway_method.predictions_overvalued_get: Refreshing state... [id=agm-i08r86q01i-8djqun-GET]
aws_api_gateway_method.predictions_undervalued_get: Refreshing state... [id=agm-i08r86q01i-kdbtn7-GET]
module.cors_teams_detail.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-e38ice-OPTIONS]
module.cors_predictions.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-pf6a9y-OPTIONS-200]
module.cors_predictions.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-pf6a9y-OPTIONS]
module.cors_teams.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-yl2ys4-OPTIONS-200]
module.cors_teams.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-yl2ys4-OPTIONS]
module.cors_predictions_player.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-udgxfw-OPTIONS]
aws_s3_object.salary_cap_static_data: Refreshing state... [id=static/salary_cap_history.json]
aws_lambda_function.transform_data: Refreshing state... [id=nba-cap-development-transform-data]
aws_iam_role_policy.lambda_s3_rds: Refreshing state... [id=nba-cap-development-lambda-execution:nba-cap-development-lambda-s3-rds]
module.cors_predictions_undervalued.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-kdbtn7-OPTIONS]
aws_lambda_function.fetch_data: Refreshing state... [id=nba-cap-development-fetch-data]
aws_lambda_function.copy_trained_model: Refreshing state... [id=nba-cap-development-copy-trained-model]
aws_lambda_function.validate_data: Refreshing state... [id=nba-cap-development-validate-data]
aws_iam_role_policy.sagemaker_custom: Refreshing state... [id=nba-cap-development-sagemaker-execution:nba-cap-development-sagemaker-custom]
aws_s3_object.feature_engineering_code: Refreshing state... [id=ml/code/feature_engineering.py]
aws_s3_bucket_versioning.data: Refreshing state... [id=nba-cap-development-data]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-0aae19d30bab785d3]
aws_s3_object.migration_files["002_add_prediction_run_tracking.sql"]: Refreshing state... [id=db/migrations/002_add_prediction_run_tracking.sql]
aws_s3_object.migration_files["001_add_etl_run_tracking.sql"]: Refreshing state... [id=db/migrations/001_add_etl_run_tracking.sql]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=nba-cap-development-data]
aws_s3_object.schema_sql: Refreshing state... [id=db/schema.sql]
module.cors_predictions_overvalued.aws_api_gateway_method.options: Refreshing state... [id=agm-i08r86q01i-8djqun-OPTIONS]
module.cors_metadata.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-8fosh2-OPTIONS]
module.cors_metadata.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-8fosh2-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-e38ice-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-e38ice-OPTIONS]
module.cors_predictions.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-pf6a9y-OPTIONS-200]
module.cors_teams.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-yl2ys4-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-udgxfw-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-udgxfw-OPTIONS]
aws_route_table.private: Refreshing state... [id=rtb-029dd305c3f4ac761]
aws_subnet.private_b: Refreshing state... [id=subnet-066bb8a4e7c4c5f71]
aws_internet_gateway.main: Refreshing state... [id=igw-0043d0b7878bef291]
aws_security_group.bastion: Refreshing state... [id=sg-044703878f38eaf04]
aws_security_group.rds: Refreshing state... [id=sg-0d332cdd9de9f1ea8]
aws_security_group.lambda: Refreshing state... [id=sg-0d348276a26bc3621]
aws_subnet.private_a: Refreshing state... [id=subnet-024001c7e70b8e723]
aws_subnet.public: Refreshing state... [id=subnet-0f1c3b45289fc2f33]
aws_security_group.vpc_endpoints: Refreshing state... [id=sg-01985e1e8d1a5b899]
module.cors_predictions_undervalued.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-kdbtn7-OPTIONS-200]
module.cors_predictions_undervalued.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-kdbtn7-OPTIONS]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_cloudfront_distribution.frontend: Refreshing state... [id=E19QA2V7TXG7IA]
aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=nba-cap-frontend-development]
aws_s3_bucket_policy.frontend: Refreshing state... [id=nba-cap-frontend-development]
module.cors_predictions_overvalued.aws_api_gateway_integration.options: Refreshing state... [id=agi-i08r86q01i-8djqun-OPTIONS]
module.cors_predictions_overvalued.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-i08r86q01i-8djqun-OPTIONS-200]
module.cors_metadata.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-8fosh2-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-e38ice-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-udgxfw-OPTIONS-200]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-026914add1fbd9388]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-086f25003cd7ad678]
aws_route_table.public: Refreshing state... [id=rtb-0f2bcd46b702b9ee0]
module.cors_predictions_undervalued.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-kdbtn7-OPTIONS-200]
aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2890896799]
aws_instance.bastion: Refreshing state... [id=i-0f6603a98461ad9cb]
aws_db_subnet_group.main: Refreshing state... [id=nba-cap-development-db-subnet]
aws_lambda_function.migrate_schema: Refreshing state... [id=nba-cap-development-migrate-schema]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-07f35ad4111286f9d]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-047e599a9347baa95]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-01aeb7d4c2f914500]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0cc2835137bdb4431]
aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-06d1351c58050b1bc]
module.cors_predictions_overvalued.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-i08r86q01i-8djqun-OPTIONS-200]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-08fac94fecdbb4de3]
aws_db_instance.main: Refreshing state... [id=db-EKSITIKQZJTCIAMKGGFH4JIJCQ]
aws_secretsmanager_secret_version.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001]
null_resource.trigger_schema_migration: Refreshing state... [id=2716770943834433870]
aws_cloudwatch_metric_alarm.rds_cpu: Refreshing state... [id=nba-cap-development-rds-high-cpu]
aws_lambda_function.extract_training_data: Refreshing state... [id=nba-cap-development-extract-training-data]
aws_lambda_function.extract_prediction_data: Refreshing state... [id=nba-cap-development-extract-prediction-data]
aws_lambda_function.api_handler: Refreshing state... [id=nba-cap-development-api-handler]
aws_lambda_function.load_to_rds: Refreshing state... [id=nba-cap-development-load-to-rds]
aws_api_gateway_integration.metadata_get: Refreshing state... [id=agi-i08r86q01i-8fosh2-GET]
aws_lambda_function.load_predictions: Refreshing state... [id=nba-cap-development-load-predictions]
aws_api_gateway_integration.predictions_overvalued_get: Refreshing state... [id=agi-i08r86q01i-8djqun-GET]
aws_api_gateway_integration.teams_detail_get: Refreshing state... [id=agi-i08r86q01i-e38ice-GET]
aws_api_gateway_integration.predictions_player_get: Refreshing state... [id=agi-i08r86q01i-udgxfw-GET]
aws_api_gateway_integration.predictions_undervalued_get: Refreshing state... [id=agi-i08r86q01i-kdbtn7-GET]
aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.predictions_get: Refreshing state... [id=agi-i08r86q01i-pf6a9y-GET]
aws_api_gateway_integration.teams_get: Refreshing state... [id=agi-i08r86q01i-yl2ys4-GET]
aws_sfn_state_machine.ml_training_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-training-pipeline]
aws_sfn_state_machine.etl_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-etl-pipeline]
aws_api_gateway_deployment.predictions_api: Refreshing state... [id=oi0ao1]
aws_api_gateway_stage.v1: Refreshing state... [id=ags-i08r86q01i-v1]
aws_iam_role_policy.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn:nba-cap-development-ml-pipeline-sfn-policy]
aws_sfn_state_machine.ml_predictions_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-predictions-pipeline]
aws_iam_role_policy.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.weekly_etl_pipeline: Refreshing state... [id=nba-cap-development-weekly-etl-WeeklyETLStateMachine]
aws_cloudwatch_metric_alarm.etl_failures: Refreshing state... [id=nba-cap-development-etl-failures]
aws_cloudwatch_event_target.monthly_etl_pipeline: Refreshing state... [id=nba-cap-development-monthly-etl-MonthlyETLStateMachine]
aws_cloudwatch_event_target.monthly_training_target: Refreshing state... [id=nba-cap-development-monthly-ml-training-MonthlyMLTrainingPipeline]
aws_iam_role_policy.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.weekly_predictions_target: Refreshing state... [id=nba-cap-development-weekly-ml-predictions-WeeklyMLPredictionsPipeline]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
        id                                    = "db-EKSITIKQZJTCIAMKGGFH4JIJCQ"
      - password                              = (sensitive value) -> null
        tags                                  = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (55 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.db_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_credentials" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260218013731188500000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.rds_from_bastion will be created
  + resource "aws_security_group_rule" "rds_from_bastion" {
      + description              = "PostgreSQL from bastion host"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d332cdd9de9f1ea8"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-044703878f38eaf04"
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Workspace:** dev
**Environment:** development
